[
  {
    "postId": "79474446",
    "postTitle": "Technical Architect--Mainframe COBOL (Microfocus)",
    "postUrl": "https://www.seek.com.au/job/79474446",
    "debugText": "We are HCLTech, one of the fastest-growing large tech companies in the world and home to 219,000+ people across 54 countries, supercharging progress through industry-leading capabilities centered around Digital, Engineering and Cloud.\n\nThe driving force behind that work, our people, are diverse, creative, and passionate, raising the bar for excellence on a regular basis. We, in turn, work hard to bring out the best in them as we strive to help them find their spark and become the best version of themselves that they can be.\n\nAt HCLTech Australia, we value the unique perspective and contributions of all individual and we actively encourage applications from Aboriginal and Torres Strait Islander people to apply for this role.\n\nAre you ready to be an important part of this ever-transformational journey?\n\n**Job summary**\n\nAn employee responsible for the technical aspects of understanding the technical detail of a HLSA and of a business initiative.\n\n**MicroFocus Platform SME--Mainframe COBOL**\n\n**>14+ Years of experience**\n\n1. **Skills**: COBOL (Mainframe & Micro Focus), PL/1, CICS, JCL, VSAM, SQL,.\n2. **Domain areas:** Legacy application, Migration, Insurance and Banking\n3. **Databases**: DB2, IDMS, IMS DB, Oracle\n\n**Responsibilities**\n\n•Solution Feasibility in relation to the solution Roadmap\n\n•Perform detailed analysis, then create, and document a “solution” is expected to solve the customer’s problem(s).\n\n•Ensuring Solution is sustainable and extendable over time\n\n•All levels of documentation and KT plans are inline with the initiatives of RLA.\n\n•Required to have a deep understanding of Microfocus platform, with 5-10 years %%U+0027%%  experience in deploying/building Microfocus platform.\n\n•Well versed in Microfocus apps like ES, ED etc.\n\n•Hands on experience on Microfocus platform upgrades/security patching.\n\n•Ability to write automation scripts, CI/CD DevOps pipelines.\n\n•Collectively responsible for the achievement of team goals -Work day-to-day in a team\n\n•Collaborate within and cross functional teams to resolve impediments\n\n•Continuous improvements – Housekeeping/Automation improvements.\n\n•Alerts and Monitoring/logging improvements\n\n**Artefacts within area of responsibility**\n\n•Solution/architecture diagrams/system roadmap\n\n•Specific to LLD /\n environment/design document which may include\n\n•Functional and Non-Functional Requirements\n\n•Application Overview/Logical Components/Configuration\n\n•Infrastructure Overview\n\n•System and application dependencies\n\n•Inbound and outbound dependencies\n\n•Data Analysis\n\n•DR\n\n•Security/Networking dependencies\n\n•Monitoring and Performance metrics\n\n**Subject matter expertise**\n\n•Experience and recognised as an expert in chosen competency – **Microfocus Platform.**\n\n•Participate in solving complex problems requiring highest competency level in specific field of expertise\n\n• **Domain areas:** Legacy application, Migration, Insurance and Banking **Databases**: DB2, IDMS, IMS DB, Oracle\n\n• **Languages/Tools/scripts**: COBOL (Mainframe & Micro Focus), PL/1, CICS, JCL, VSAM, SQL,.\n\n**Why Us**\n\nWe are one of the fastest-growing large tech companies in the world, with offices in 50+ countries across the globe and 219,000 employees.\n\n- Our company is extremely diverse with 165 nationalities\nrepresented.\n- We offer the opportunity to work with colleagues across the globe.\n- We offer a virtual-first work environment, promoting a good work-life integration and real flexibility.\n- We offer comprehensive benefits for all employees.\n- We are a certified great place to work and a top employer in 17 countries, offering a positive work environment that values employee recognition and respect.\n\n_**Equality & Opportunity for All**_\n\n_Representing 165 nationalities across the globe, we pride ourselves on being an equal opportunity employer, committed to providing equal employment opportunities to all applicants and employees regardless of race, religion, sex, colour, age, national origin, pregnancy, sexual orientation, physical disability or genetic information, military or veteran status, Aboriginal and Torres Strait Islander people or any other protected classification, in accordance with federal, state, and/or local law_",
    "score": 18.407378792762756,
    "role": "Developers/Programmers (Information & Communication Technology)",
    "workType": "Full time",
    "companyDetail": {
      "referenceId": "158328604875959",
      "name": "HCLTech",
      "url": "https://www.hcltech.com/geo-presence/australia",
      "linkedin": "https://guce.yahoo.com/terms?locale=en-AU",
      "description": "HCLTech is a global technology company, home to more than 219,000+ people across 60 countries, delivering industry-leading capabilities centered around digital, engineering and cloud, powered by a broad portfolio of technology services and products. We work with clients across all major verticals, providing industry solutions for Financial Services, Manufacturing, Life Sciences and Healthcare, Technology and Services, Telecom and Media, Retail and CPG, and Public Services. Consolidated revenues as of 12 months ending June 2024 totaled $13.4 billion. To learn how we can supercharge progress for you, visit hcltech.com",
      "industry": "Information & Communication Technology",
      "headQuarters": "Noida, Uttar Pradesh",
      "specialties": [
        "Manufacturing",
        "Aerospace & Defense",
        "Financial Services",
        "Telecom",
        "Retail & CPG",
        "Life Sciences & Healthcare",
        "Media & Entertainment",
        "Travel",
        "Transportation & Logistics",
        "Automotive",
        "Government",
        "Energy & Utilities",
        "Consumer Electronics",
        "Healthcare",
        "Cloud",
        "Digital",
        "Engineering",
        "AI",
        "Technology and Services",
        "and Software"
      ],
      "lastUpdate": "2024-10-23T13:23:03.078230212+00:00",
      "jobPosted": 0,
      "groupSize": "SIZE_A",
      "locations": ""
    },
    "locations": "Sydney NSW",
    "expiringDate": "2024-11-13T12:59:59.999Z",
    "payRange": "",
    "hittedKeywords": []
  },
  {
    "postId": "79443221",
    "postTitle": "Cloud & Infrastructure Architect",
    "postUrl": "https://www.seek.com.au/job/79443221",
    "debugText": "- **Great opportunity to join our Digital, Data and Technology team**\n- **Scope and design our overarching Cloud solution and infrastructure design**\n- **Permanent position based in Sydney or Melbourne**\n- **Salary from to $185,637 plus 15.4% superannuation**\n\n**The team**\n\nThe Digital, Data & Technology (DD&T) group is responsible for delivering transformational change and key technology related operational services across ASIC. The DD&T group includes Information Technology, Cyber Security, Data, Digital, EPPO (Enterprise Planning Performance Office) and Registry Connect (modernising ASIC %%U+0027%% s Business Registers).\n\nThis team provides a wide range of development and support services to ASIC. We are undertaking major projects that will transform our business and continue our significant business transformation in a number of areas such as data and analytics, cloud, mobility and application modernisation. We make use of the latest technology with an increased focus on data sharing and analytics which will make ASIC a best in class regulator supporting the Australian Financial Markets\n\n**The role**\n\nThe Cloud and Infrastructure Architect is responsible for scoping and designing the overarching Cloud solution and infrastructure designs (High & Low level) in conjunction with Subject Matter Experts, Engineering, Project Managers and peer Architects.\n\n**About you**\n\nWe are looking for someone with minimum of five years in Cloud Solution / Infrastructure Architecture position backed by substantial SME experience on a range of infrastructure technologies.\n\nYou will have extensive experience in Technical Solutions Architecture across several of the following areas:\n\n- Azure and AWS Cloud Services across IaaS, PaaS and SaaS.\n- AAD/Entra ID, Active Directory, ADFS, synchronisation, Identity Management and Access management\n- MS Office, MS Teams and M365 services.\n- MS Windows Server 2012-2022 and related services.\n- Hyper-converged infrastructure including VMWare and NetApp.\n- Networking platforms including Cisco, Fortinet, F5 and Netskope.\n\nYour strong communication skills will enable you to effectively articulate Solution Designs to key stakeholders including ASIC %%U+0027%% s Technical Design Authority and Architecture Governance Council.\n\n**A** **bout ASIC**\n\nASIC %%U+0027%% s remit is one of the broadest of regulators across the world.\n\nASIC regulates corporations, markets, financial services and consumer credit, and monitors and promotes market integrity and consumer protection in the Australian financial system.\n\nThrough our enforcement and regulatory work, we hold to account those who contravene the law, working to achieve strong outcomes that address the greatest consumer and investor harms.\n\nThrough Moneysmart, we aim to improve the skills and knowledge of Australians and provide information and tools to help them in their financial decision making.\n\nA future with ASIC means that your work will contribute to achieving ASIC %%U+0027%% s vision for a fair, strong, and efficient financial system for all Australians.\n\nASIC is committed to a providing a diverse and inclusive workplace where the very best talent in Australia chooses to work. Indigenous Australians are encouraged to apply as well as applicants from all backgrounds and with different abilities.\n\nTo work with us, you need to be an Australian citizen, and be prepared to complete an ASIC Suitability and Baseline Assessment, which is issued by ASIC %%U+0027%% s Security team.\n\nView the position description for more information or click ‘apply %%U+0027%%  to start your application.\n\n**Applications for this role will close at 11:59pm on 8 November 2024.**",
    "score": 14.426345437765121,
    "role": "Architects (Information & Communication Technology), Government - Federal (Government & Defence)",
    "workType": "Full time",
    "companyDetail": {
      "referenceId": "795441",
      "name": "ASIC",
      "url": "http://asic.gov.au/",
      "linkedin": "https://guce.yahoo.com/terms?locale=en-AU",
      "description": "ASIC is Australia’s integrated corporate, markets, financial services and consumer credit regulator.\nASIC’s vision is for a fair, strong and efficient financial system for all Australians.\nTo realise our vision we will use all our regulatory tools to:\n- Change behaviours to drive good consumer and investor outcomes;\n- Act against misconduct to maintain trust and integrity in the financial system;\n- Promote the strong and innovative development of the financial system;\n- help Australians to be in control of their financial lives.\nThere is a reason for everything we do, every law we regulate, every action we take, every interaction we have with industry and consumers. We’re proud of the difference we make.\nWe inform. We educate. We regulate.\nA future with ASIC means that you will work alongside those at the forefront of regulatory practice.\nWe value what you’ll bring. We value those who have sharp analytical minds and are open to challenging the way things are done. Our opportunities cover all career stages from entry to leadership level.",
      "industry": "Government Administration",
      "headQuarters": "Sydney, NSW",
      "lastUpdate": "2024-10-23T11:35:32.682951296+00:00",
      "jobPosted": 0,
      "groupSize": "SIZE_A",
      "specialties": [],
      "locations": ""
    },
    "locations": "Sydney NSW",
    "expiringDate": "2024-11-10T12:59:59.999Z",
    "payRange": "",
    "hittedKeywords": []
  },
  {
    "postId": "79709504",
    "postTitle": "Enterprise Architect POS Business Banking",
    "postUrl": "https://www.seek.com.au/job/79709504",
    "debugText": "**Join Our Team as a Business Banking Architect!**\n\nAre you ready to shape the future of Business Banking? We’re looking for a visionary Business Banking Architect to join our dynamic team. This senior role offers the opportunity to work closely with the Head of Architecture and other senior leaders across the bank to craft and maintain our cutting-edge Business Banking technology strategy.\n\n**What You’ll Do:**\n\n- **Collaborate and Innovate:**\nWork hand-in-hand with Business Banking teams to identify strategic architectural opportunities. Your insights will drive our medium-term planning and quarterly business reviews.\n\n- **Design Future-Ready Solutions:**\nCreate end-to-end solutions (Cloud, Hybrid) for business banking, including front-end mobile and core banking integrations.\n\n- **Lead Major Programs:**\nDefine architecture for significant programs and projects, guiding teams through implementation.\n\n- **Drive Technological Excellence:**\nManage the lifecycle of solutions, conduct technology watch, and develop proofs of concept for our platforms and systems.\n\n- **Vendor Management:**\nAssess and evaluate vendors, and manage technology aspects related to RFP processes.\n\n- **Global Collaboration:**\nPartner with global counterparts to define target state architecture, encompassing business functions, applications, interfaces, and technical components.\n\n\n**What We’re Looking For:**\n\n- **Expertise in Enterprise Architecture:**\nExtensive experience in enterprise architecture and business banking, including Point of Sale Technology integration (POS).\n\n- **Tech-Savvy:**\nProficiency in cloud computing, data analytics, and cybersecurity.\n\n- **Regulatory Knowledge:**\nStrong understanding of regulatory frameworks and compliance.\n\n- **Leadership Skills:**\nExcellent leadership and project management abilities.\n\n- **Communication Skills:**\nAbility to convey complex technical concepts to non-technical stakeholders\n\n\n**Desirable Skills:**\n\n- **AI and Machine Learning:**\nExperience with AI and machine learning applications in banking.\n\n- **Blockchain Knowledge:**\nFamiliarity with emerging technologies, including blockchain and its potential uses in finance.\n\n- **Top-Tier Experience:**\nPrevious experience in a similar role within a top-tier financial institution.\n\n\n**What’s in it for you?**\n\nDrop everything and learn with over 16,000 professional and personal development courses to choose from\n\nDiscounted ING Health Insurance\n\nAn additional Rest Day to support your wellbeing\n\nAn IMPACT Day to volunteer on approved sustainability activity\n\n**About Us**\n\nAt ING, we want to make life simpler and more worthwhile – for everyone who banks with us, for the people who work with us, and the community at large, too.\n\nWhen you come to work at ING, you are joining a team where individuality is not just accepted, it is encouraged. We have built a culture that is fun, friendly, and supportive – it is the kind of place where you can be yourself and make the most of whatever you have to offer.\n\nWe give people the freedom to think differently, take ownership of their work, and make great things happen. We are here to help you get ahead. And with our global network, there is plenty of scope to take your career in new directions, perhaps even ones you have never considered.\n\nWe are all about celebrating success and as a result we are proud to be a WGEA Employer of Choice for Gender Equality and a certified Family Inclusive workplace.\n\nSound like the kind of place you would feel at home? We would love to hear from you.\n\n(One last thing, ING operates a direct talent sourcing model. So, no agency introductions, please.)\n\nApplications close 15th November 2024\n\n**Before you apply**\n\nHere at ING, we consider employee development to be important and encourage existing employees to apply for suitable internal positions. It is expected that any employee applying for a vacant position would have been in their current role for a minimum of twelve (12) months before applying. This may be waived in exceptional circumstances and after consultation with your manager.\n\n**Still in two minds?**\n\nAt ING, we know that diversity drives innovation. Research reveals that 60% of women and underrepresented groups may pause at this stage, even after starting their application. Don’t miss out on the opportunity to bring your unique perspective to our team - submit your application today!\n\n#LI-DNI",
    "score": 14.363982647657394,
    "role": "Architects (Information & Communication Technology)",
    "workType": "Full time",
    "companyDetail": {
      "referenceId": "433004",
      "name": "ING",
      "linkedin": "https://guce.yahoo.com/terms?locale=en-AU",
      "description": "ING - the trading name of ING Bank (Australia) Limited - is part of the world %%U+0027%% s leading direct bank, and is wholly owned by ING Group. At ING we recognise that financial services form the foundation of a healthy society and we have a role to play in shaping a positive future for Australia. This role goes beyond delivering monetary returns - we have an opportunity to use our scale, reach and expertise to help our customers, our employees and the society in which we work prosper.\nSource: this is an extract from the company’s own website",
      "industry": "Banking",
      "headQuarters": "Sydney, NSW",
      "lastUpdate": "2024-10-23T17:00:17.169074301+00:00",
      "url": "",
      "jobPosted": 0,
      "groupSize": "SIZE_A",
      "specialties": [],
      "locations": ""
    },
    "locations": "Sydney NSW",
    "expiringDate": "2024-11-22T09:38:18.000Z",
    "payRange": "",
    "hittedKeywords": []
  },
  {
    "postId": "79383659",
    "postTitle": "Senior Architect - Core Banking & Product Architecture",
    "postUrl": "https://www.seek.com.au/job/79383659",
    "payRange": "$0 - $0",
    "debugText": "**About the Role**\n\nAs Senior Architect - Core Banking & Products Architecture, you will be responsible for providing strategic leadership and technical expertise in designing and maintaining the architecture of our organization %%U+0027%% s core banking platform (with special focus on Temenos T24). You will play a pivotal role in driving innovation, efficiency, and scalability of our banking technology infrastructure. This position requires at least 10+ years of experience, with deep understanding of banking operations, modern technology trends, and a proven track record in architecting, migrating and implementing a material core banking transformation.\n\nKey Responsibilitie will include:\n\n- Develop and maintain a long-term architecture vision for the Temenos core banking and product systems, aligned with the organization %%U+0027%% s business objectives and regulatory requirements.\n- Collaborate with the executive team and other stakeholders to understand business needs and translate them into technical requirements and architectural designs.\n- Establish and communicate architectural guidelines, principles, and best practices to ensure consistent and standardized solutions.\n- Lead and create architectures and designs of BOQ group’s core banking systems, including but not limited to Temenos T24 core banking platforms, other product systems (e.g. leasing), customer master systems, and integration with third-party services.\n- Guide colleagues and other teams with detailed knowledge about T24 Core Banking capabilities, features and configuration possibilities to assist with fit/gap and impact assessments for new requirements\n\n**About you**\n\nJoining our team as Senior Architect - Core Banking & Product Architecture presents an exciting opportunity to shape the future of our BOQ’s digital banking landscape and deliver exceptional services to our business and retail customers. If you are an expert in Temenos T24 Core Banking (or an equivalent mature core banking platform) and a forward-thinking banking technology professional with a passion for innovation and a track record of successful architectural/design, transformation and migration experience we invite you to apply for this position and be a key driver of our organization %%U+0027%% s growth and success.\n\n**About Us**\n\nBOQ Group is a truly unique group of challenger brands with a purpose – to provide a genuine alternative to Australian financial services for customers and employees.\n\nOur family of brands (Bank of Queensland (BOQ), ME Bank, Virgin Money Australia, BOQ Specialist), each come with their own defined customer audience and brand personality, but share one goal – to build social capital through banking. That’s creating trust with customers, exploring staff potential and believing that tiny gestures and big ideas can change the world for communities.\n\nBOQ Group’s inclusive vision is to foster a workspace that values and leverages difference and creates new possibilities, a place where our people feel confident to bring their best selves to work every day. We embrace difference and believe that our workforce should reflect the customers and communities that we serve.\n\nSince 2021, BOQ Group is recognised as an Employer of Choice for Gender Equality by the Workplace Gender Equality Agency (WGEA).\n\nIn 2023, we successfully implemented an innovative Reconciliation Plan, driving positive change and promoting inclusivity across BOQ Group.\n\n**Our Benefits**\n\n• Flexible working arrangements\n\n• Discounted financial products\n\n• Salary sacrificing options\n\n• Paid parental leave with no minimum\n\n• Purchase annual leave\n\n• Discounted private health insurance plan\n\n• Employee Assistance Program (EAP)\n\n• Access to employee network groups focused on First Nations Reconciliation, LGBTQIA+, Multicultural, Gender, Early Careers and accessibility\n\n• BOQ Group is a member of Pride in Diversity and a participating organisation in the Australian Workplace Equality Index\n\n**How to Apply**\n\nTo apply for this role at #boqgroup #grouptech,\nfollow the links or apply via our\nCareers Page.\n\nBOQ Group\nis committed to diversity and an inclusive workforce. Aboriginal and Torres Strait Islander People are encouraged to apply.\n\nWe celebrate, value and include people of all backgrounds, gender and expressions, sexualities, cultures, bodies and abilities. When you apply, you are welcome to tell us the pronouns you use and please let us know any reasonable adjustments you may need during the interview process.\n\nIf you are successful for a role with BOQ Group, it is a condition of employment that background screening is completed to ensure that the Bank complies with its obligations under the Anti-Money Laundering and Counter Terrorism Financing Act. These checks may include, but are not limited to: identity, verification, reference checks, criminal background checks, immigration checks, verification of academic qualifications, bankruptcy checks.\n\n**Please no agency applications.**",
    "score": 13.658684968948364,
    "role": "Architects (Information & Communication Technology)",
    "workType": "Full time",
    "companyDetail": {
      "referenceId": "432535",
      "name": "Bank of Queensland",
      "url": "https://www.boq.com.au/About-us/company-overview",
      "linkedin": "https://guce.yahoo.com/terms?locale=en-AU",
      "description": "BOQ Group is a truly unique group of challenger brands with a purpose – to provide a genuine banking alternative for customers and employees. Our family of brands (Bank of Queensland (BOQ), ME, Virgin Money Australia, BOQ Specialist, BOQ Business, BOQ Finance), each come with their own defined customer audience and brand personality, but share one goal – to build social capital through banking. That’s creating trust with customers, exploring staff potential and believing that tiny gestures and big ideas can change the world for communities.",
      "industry": "Banking & Financial Services",
      "headQuarters": "Newstead, QLD",
      "specialties": [
        "Personal & Business Banking and Unique Owner-Manager Model"
      ],
      "lastUpdate": "2024-10-23T13:23:11.167156175+00:00",
      "jobPosted": 0,
      "groupSize": "SIZE_A",
      "locations": ""
    },
    "locations": "Sydney NSW",
    "expiringDate": "2024-11-08T12:59:59.999Z",
    "hittedKeywords": []
  },
  {
    "postId": "79275007",
    "postTitle": "Solution Architect / Technical Lead",
    "postUrl": "https://www.seek.com.au/job/79275007",
    "payRange": "$1200 pd + super",
    "debugText": "**Solutions Architect / Technical Lead - Government Department**\n\n- Contract until 30/06/2024 + extensions\n- $1200 pd + super based on experience\n- CBD Location + WFH (hybrid)\n\n The role develops, maintains and supports the design, use and delivery of appropriate solution architecture to improve business information access, compliance and leveraging of information to validate data-driven strategic\n\nplanning, policy development and operational decisions to meet business needs and align with department for NSW information technology strategy.\n\nKey accountabilities\n\n- Translate strategic technology plans by constructing solutions, applications and delivering services to solve business issues.\n- Support and maintain comprehensive solution architecture models, policies, standards and procedures to deliver quality options and solutions to program and project teams.\n- Deliver, monitor and evaluate solution architecture projects to develop, improve and maintain data and information models across Transport projects.\n- Promote ongoing use of information and governance tools and processes such as glossaries and registers to optimise and support information solution leverage and compliance with architecture principles and standards.\n- Collaborate with project managers to reduce technical complexity through solution design documents that specify and describe features, phases and operational delivery.\n- Provide review, commentary and endorsement of information architecture options and recommendations in solution architectures and technical designs across the full lifecycle of IT business ideas and projects.\n\nKey knowledge and experience\n\n- End to End Solution Architecture experience\n- Application developement / Integration experience, highly regarded\n- Strong M365\n- Microsoft and Azure\n- Demonstrated skill and experience in the delivery of solutions architecture.\n- Ability to manage time and meet deadlines while balancing competing priorities\n- Strong analytical and problem solving skills.\n- Develop strong relationships with senior stakeholders and promote compliance with relevant strategies policies, legislation and architectural governance.\n\n**If you have the above skills, please contact for a confidential discussion**",
    "score": 11.785544134676456,
    "role": "Architects (Information & Communication Technology)",
    "workType": "Contract/Temp",
    "companyDetail": {
      "referenceId": "31300304",
      "name": "TRS - Public Sector",
      "linkedin": "https://guce.yahoo.com/terms?locale=en-AU",
      "description": "We are an independent Recruitment Agency based in Haymarket, Sydney. We have been operating since 2005.\n\nRecruitment is a competitive Business, you need to stand out. We are proud to be different.\n\nGovernment; TRS is an approved supplier to NSW Government via the SCM0007, SCM0020 & SCM0012 Panels - ICT, Technical, Specialist, Finance, Professional, Administration \n\nIT&T: We work across all industry sectors within the IT&T Sector. Particular areas of specialisation include: BIG Data & Data Analytics, Infrastructure, EAI & EIM, BI/DW, Development, Testing and SAP.\n\nAdvertising & Media: Specialities include; All things Digital, Technologists, Account Services, Senior Appointments and Finance.\n\nMarketing: Our core speciality in this sector is Digital & On-Line Marketing, with a particular focus on SEO & SEM.\n\nTRS has the ability to help international candidates to Australia - we provide relocation advice and have the capability to sponsor for internal roles.\n\nGeographically TRS covers the whole of Asia.\nPhysically we are located in Sydney.\n\nwww.totalresource.com.au + 61 2 8705 8500",
      "industry": "Staffing and Recruiting",
      "groupSize": "SIZE_B",
      "headQuarters": "Sydney, New South Wales",
      "specialties": [
        "IT",
        "Sales & Marketing",
        "Advertising",
        "E-Commerce",
        "Media",
        "Finance",
        "Engineering",
        "Recruitment",
        "Onboarding",
        "Payrolling",
        "Contract Recruitment",
        "and Government Recruitment"
      ],
      "lastUpdate": "2024-10-23T13:23:00.430917086+00:00",
      "url": "",
      "jobPosted": 0,
      "locations": ""
    },
    "locations": "Sydney NSW",
    "expiringDate": "2024-10-31T23:01:00.000Z",
    "hittedKeywords": []
  },
  {
    "postId": "79651409",
    "postTitle": "Solution Architect",
    "postUrl": "https://www.seek.com.au/job/79651409",
    "debugText": "_PM-Partners group is a specialist Project Management Consultancy. We have a unique way of running projects and providing training and advice, so our clients get the best results with less cost and risk. Each year we deliver over $3B of projects, train over 10,000 people, and help some of Australia’s leading brands improve their PMOs._\n\nMy client, is currently looking for **Solution Architect to join on a rolling contract basis**. You will have the opportunity to help design, build, and own the end-to-end upgrade of the **electronic document management system** from on-prem to cloud. You will also lead the delivery of **solution architecture strategy and artefacts** including roadmaps, solution on a page and supporting data architecture patterns.\n\n**What you offer?**\n\n- Background in designing and solutioning cloud native products\n- Experience in solution and data architecture and designing solutions on AWS leveraging SaaS, IaaS, PaaS cloud offerings\n- Ability to understand and anticipate business needs to provide appropriate architecture guidance\n- Knowledge of solution and data architecture frameworks in Legal, Risk and Finance Technology, modelling tools and data security principles\n- Experience working with business stakeholders, engineers, project teams to manage their requirements\n- Strong focus on latest technology trends and how we can leverage these capabilities to build best in breed products.\n- Understanding of electronic document management systems, desirable.\n\n**What we can offer you!**\n\n- **Culture**: A fun, fast paced, collaborative delivery environment\n- **People**: A group of talented, experienced, and dedicated Consultants to work by your side with a dedicated Relationship Manager\n- **Passion**: Ability to band together when under pressure to deliver first class results to clients\n- **Transparency**: Open door policy\n- **Professional Development**: On the job development and access to certifications in our Training practice\n- **Care and Support**: On-going support and advice from experienced PM-Partners Consultants\n- **Knowledge**: Access to PM-Partners Delivery and Advisory practices\n\n**If you feel you meet our selection criteria, please submit your resume to Paul Woodhead at PM-Partners via LinkedIn or SEEK application or email** [**–**](mailto:%E2%80%93%E2%80%AFrnarciso@pm-partners.com.au) **paulw@pm-partners.com.au**",
    "score": 11.738202780485153,
    "role": "Architects (Information & Communication Technology)",
    "workType": "Contract/Temp",
    "companyDetail": {
      "referenceId": "20626694",
      "name": "PM-Partners Group",
      "linkedin": "https://guce.yahoo.com/terms?locale=en-AU",
      "description": "PM-Partners are strong advocates and practitioners of Agile and Scaled Agile, and have a 25-year pedigree in traditional project management, programme management and portfolio execution. We believe our multi-modal approach enables the right blend of best practice frameworks and methods for your organisation to succeed.\n\nOur expert team of advisors, coaches, and practitioners thrive on one thing – quality execution.\n\nWe are proud to work with some of the most innovative and inspiring organisations across Australia and south-east Asia. Our customers develop critical infrastructure, improve our healthcare systems, make our skies safer, reduce financial crime and fraud, build safer and healthier communities, and deliver high-speed networks to make your Netflix faster!\n\nFounded in Australia in 1996, PM-Partners is proud to be a homegrown Australian company. Today we are part of the $4.5bn OUTSOURCING Inc. group, which has over 80 operating units in 22 countries. \n\nPM-Partners has 28 globally recognised certifications and accreditations. With over 300 experts our team has helped our customers achieve their goals through excellence in project delivery and skills uplift.",
      "industry": "Business Consulting and Services",
      "groupSize": "SIZE_D",
      "headQuarters": "Sydney, NSW",
      "specialties": [
        "Transformation and Turnaround",
        "Business Agility",
        "Project Delivery",
        "Project and Agile Resourcing",
        "Consulting & Advice",
        "Managed PMO",
        "Portfolio Governance",
        "Health Checks & PIRs",
        "Capability & Maturity Assessments",
        "Methodology & Frameworks",
        "Capability uplift",
        "Business Analysis",
        "Project training",
        "Project management courses",
        "Agile courses",
        "Project management consulting",
        "SCRUM training",
        "and Scaled Agile"
      ],
      "lastUpdate": "2024-10-23T11:40:58.798201669+00:00",
      "url": "",
      "jobPosted": 0,
      "locations": ""
    },
    "locations": "Sydney NSW",
    "expiringDate": "2024-11-21T00:00:00.000Z",
    "payRange": "",
    "hittedKeywords": []
  },
  {
    "postId": "79637059",
    "postTitle": "Enterprise Architect - 12 month contract - Federal",
    "postUrl": "https://www.seek.com.au/job/79637059",
    "debugText": "Pathway Search %%U+0027%% s federal government client is seeking an Enterprise Architect for a 12-month contract to play a critical role in managing risks and resolving issues across a wide range of complex activities. This position requires a detail-oriented professional capable of significant decision-making and independent judgement. The Enterprise Architect will coordinate and lead sensitive or complex projects, ensuring that outcomes align with the agency %%U+0027%% s strategic and operational priorities.\n\n**Key Responsibilities:**\n\n- Collaborate with the Director of Enterprise Architecture and Strategy, as well as Enterprise Architects, to develop a high-quality enterprise architecture that aligns with the agency %%U+0027%% s corporate plan and priorities.\n- Ensure business solutions align with the agency’s goals and objectives.\n- Maintain compliance with Enterprise Architecture models, methodologies, principles, policies, standards, and strategic direction.\n- Engage with business stakeholders to understand tactical and strategic objectives and requirements.\n- Provide technical oversight, resolving complex issues during project planning, discovery, and delivery phases.\n- Deliver coherent technical business solutions across various domains.\n- Represent solutions through relevant governance processes, including the Architecture Review Board (ARB).\n- Adhere to the division-wide ARB approval framework and architecture compliance methodology.",
    "score": 10.862418720498681,
    "role": "Architects (Information & Communication Technology)",
    "workType": "Contract/Temp",
    "companyDetail": {
      "referenceId": "45907166",
      "name": "Pathway Search",
      "linkedin": "https://guce.yahoo.com/terms?locale=en-AU",
      "description": "Pathway Search is a specialist Technology Recruitment and Consulting team.  \nBringing over 15 years of technology and engineering expertise, we work with an array of clients from start-ups to large corporations across the Syndey market.  \n\nWe cover: Technology and Digital, UI/UX, Cloud, Data, Testing, Project Services, Business Analysts, and Project Managers.  \n\nThe success of our team stems from our Core Values:  \nPassion  \nIntegrity  \nPositivity  \nGrowth mind set  \nANYTHING is possible  \n\nOur team’s reputation is built on honest and integrity, as we are a driven and passion group of recruiters who love Tech and adventures outside of our office walls!  \n\nIf you’re looking for your next career move or looking for your next hire, we are here to help.",
      "industry": "Information Technology & Services",
      "headQuarters": "Sydney",
      "specialties": [
        "Cloud",
        "DevOps",
        "Project Manager",
        "Software Engineering",
        "Data",
        "Cyber",
        "Developers",
        "SQL",
        "Cloud",
        "Engineers",
        "Business Analyst",
        "Full Stack",
        "SEO",
        "Data Warehouse",
        "Project Coordinators",
        "IOS and Android",
        "Product Designers",
        "Application Support",
        "and Testing"
      ],
      "lastUpdate": "2024-10-23T13:23:13.043691550+00:00",
      "url": "",
      "jobPosted": 0,
      "groupSize": "SIZE_A",
      "locations": ""
    },
    "locations": "Sydney NSW",
    "expiringDate": "2024-11-20T06:04:00.000Z",
    "payRange": "",
    "hittedKeywords": []
  },
  {
    "postId": "79558631",
    "postTitle": "Senior Solutions Architect",
    "postUrl": "https://www.seek.com.au/job/79558631",
    "debugText": "We are seeking a highly skilled **Senior Solution Architect** who will contribute to uplift RBA %%U+0027%% s Risk Management System. The position is a 1 year fixed-term contract.\n\nWe are looking for a Senior Solutions Architect who:\n\n- Define solutions architectures, high-level designs, and impact assessments for initiatives and/or systems in the Bank.\n\n- Take ownership of Architecture deliverables for Conceptual and Solution Architecture documents and ensure that they are agreed and endorsed by all stakeholders.\n\n- Work with analysts in defining business requirements, and work with subject matter experts to develop high level designs, in line with the enterprise architecture, patterns and practices. This may occasionally extend to assist with detailed design work.\n\n- Collaborate with project managers and other stakeholders in scoping initiatives, ensuring they are scoped in accordance with architectural objectives and principles.\n\n- Has experience in producing Solution Architectures for complex solutions (including infrastructure, cloud, on-premise and hybrid solutions)\n\n- Ability to identify and document / call out dependencies with other projects / systems.\n\n- Drive Architectural Certification process to completion for key project deliverables.\n\n**Technical Capabilities**\n\n- Highly Desirable to have experience in Risk Management System (e.g., Protecht) implementation.\n\n- Experience with development principles, tools, and frameworks.\n\n- Strong interpersonal skills, including teamwork, facilitation, and negotiation.\n\n- Demonstrated ability to communicate, influence and persuade peers and senior stakeholders.\n\n- Understanding of strategic and new and emerging technologies and their practical application.\n\n- Understanding of relevant models, notations and tools.\n\n- Strong experience in resolving solution design and architecture contentions.\n\n- Sound experience in architectural disciplines across a range of complex projects and technologies.\n\n**Qualifications**\n\n- TOGAF is preferred.\n\n- Tertiary qualifications relevant to the Bank or IT industry.\n\n**Be More**\n\nThe RBA makes an important contribution to the Australian economy through the pursuit of national economic policy objectives and associated activities in financial markets and banking. We also issue Australia %%U+0027%% s banknotes and operates infrastructure critical to the payments system, all of which contribute to the welfare of the Australian people.\n\nMade up of specialists across a wide range of fields, our people have a meaningful role to play in achieving these objectives. Our people conduct themselves with a high degree of integrity, while striving for excellence in the work they perform and the outcomes they achieve. We encourage intelligent inquiry, and we treat one another with respect while promoting the public interest through our efforts.\n\nWe know it is the growth and success of our people that drives the Bank forward. Come and make a bigger contribution while you build and develop your own skills too, because being more means you can do more, for yourself and for Australia.\n\n**The Reserve Bank of Australia is an equal opportunity employer. We are committed to crafting a diverse and inclusive environment and encourage applications from expert candidates seeking workplace flexibility.**",
    "score": 10.6250561773777,
    "role": "Architects (Information & Communication Technology), Government - Federal (Government & Defence)",
    "workType": "Full time",
    "companyDetail": {
      "referenceId": "433652",
      "name": "Reserve Bank of Australia",
      "url": "http://www.rba.gov.au/",
      "linkedin": "https://guce.yahoo.com/terms?locale=en-AU",
      "description": "The Reserve Bank of Australia (RBA) is Australia %%U+0027%% s central bank and derives its functions and powers from the Reserve Bank Act 1959. Its duty is to contribute to the stability of the currency, full employment, and the economic prosperity and welfare of the Australian people. It does this by setting the cash rate to meet an agreed medium-term inflation target, working to maintain a strong financial system and efficient payments system, and issuing the nation %%U+0027%% s banknotes. The RBA provides certain banking services as required to the Australian Government and its agencies, and to a number of overseas central banks and official institutions. Additionally, it manages Australia %%U+0027%% s gold and foreign exchange reserves.\nSource: this is an extract from the company %%U+0027%% s own website",
      "industry": "Banking",
      "headQuarters": "Sydney, NSW",
      "specialties": [
        "Monetary Policy",
        "Market Operations",
        "Financial Stability",
        "Payments System",
        "Financial Services",
        "and Banknotes"
      ],
      "lastUpdate": "2024-10-23T11:30:46.972343553+00:00",
      "jobPosted": 0,
      "groupSize": "SIZE_A",
      "locations": ""
    },
    "locations": "Sydney NSW",
    "expiringDate": "2024-11-15T23:08:24.000Z",
    "payRange": "",
    "hittedKeywords": []
  },
  {
    "postId": "79538871",
    "postTitle": "1 x EL1 Enterprise Architect",
    "postUrl": "https://www.seek.com.au/job/79538871",
    "payRange": "$1050 - $1275 p.d. + Weekly pays",
    "debugText": "- **Canberra, Sydney - Surry Hills, Melbourne - Geelong or Richmond**\n- **Ability to obtain a Baseline Security Clearance required**\n- **12+12 month Federal Government contract**\n\nOur client, an independent statutory agency who support a better life for hundreds of thousands of Australians with a significant and permanent disability, is seeking an **EL1 Enterprise Architect** to join their team.\n\n**Duties/skills:**\n\n- Assisting the director of Enterprise Architecture and Strategy to deliver a high quality, fit for purpose enterprise architecture that aligns with the agency corporate plan and agency priorities.\n- Providing technical oversight and facilitating complex issues resolution arising during project planning, discovery and delivery.\n- Assist with representing the solutions being developed through all relevant governance processes, including the Architecture Review Board (ARB).\n- Assisting in the development of a division wide ARB approval framework and division wide methodology for all architecture compliance and approvals.\n\n**Criteria:**\n\n- Excellent listening, communication, and stakeholder management skills.\n- Broad **technical & business layer architectural background** delivering business solution architectures for projects\n- 3 years of Architecture experience.\n- Industry experience across financial, health or insurance sectors.\n\n**How to apply**\n\nTo be considered for this role **(JOB ID: CW10043),** please forward your resume to Coral by clicking the _quick apply_ button.\n\nPlease note only suitable applicants will be contacted.\n\n**Job ID CW10043 closes on Thursday, 31 October at 10am.**\n\nRecruitment Hive: (02) 6299 1006",
    "score": 10.4280723053962,
    "role": "Architects (Information & Communication Technology)",
    "workType": "Contract/Temp",
    "companyDetail": {
      "referenceId": "401135233",
      "name": "Recruitment Hive",
      "linkedin": "https://guce.yahoo.com/terms?locale=en-AU",
      "description": "How are you placed for tomorrow?\n\nAt Recruitment Hive, we’re all about placing leading ICT professionals in fulfilling roles. For us, Canberra’s not a satellite office, it’s home. We identify and build relationships with the highest calibre ICT professionals and offer transparent, moderate fees. We’re passionate about working hard to help the federal government benefit all Australians via innovative technology outcomes.\n\nWhat exactly do we do?\n\nRecruitment Hive is a specialist ICT recruitment company that provides ICT contracting services to federal government, primarily within the ACT. We’re all about quality, so we’ve developed strong internal processes to assist us in identifying, tracking and engaging with the highest quality ICT professionals. From Federal Government requirements and clearances to expert advice on ICT resumes and contacts, we know how to get you the ICT gig you’re after.\n\nWhy do candidates and hiring managers choose us? \n\nWe’re warm and friendly to work with, and we know the Canberra ICT sector better than anyone else out there. Our technology is better. And importantly…we openly display our reasonable fee structure.\nMany of our competitors train their people to negotiate up the client rate and negotiate down the contractor rate, maximising fee margin at the expense of contractor and client fairness. We don’t believe this is right. So we’re 100% up-front with an uncomplicated and reasonable rate structure. \n\nCheck out our transparent fees at recruitmenthive.com.au, call us today on 02 6299 1006, or email us on info@recruitmenthive.com.au",
      "industry": "IT Services and IT Consulting",
      "groupSize": "SIZE_B",
      "headQuarters": "Canberra, ACT",
      "specialties": [
        "Information Technology",
        "Recruitment",
        "Human Resources",
        "Canberra",
        "Contract",
        "Contracting",
        "Federal Government",
        "ICT Contracting",
        "IT Contracting",
        "Contractor",
        "Java",
        ".NET",
        "Project Manager",
        "Business Analyst",
        "Solutions Architect",
        "Test Analyst",
        "Developer",
        "Change Manager",
        "Support",
        "Cloud",
        "SAP",
        "Data Science",
        "Cyber Security",
        "Systems Engineer",
        "Network Engineer",
        "Systems Analyst",
        "Agile",
        "and Canberra"
      ],
      "lastUpdate": "2024-10-23T11:42:01.632893421+00:00",
      "url": "",
      "jobPosted": 0,
      "locations": ""
    },
    "locations": "Sydney NSW",
    "expiringDate": "2024-11-15T04:03:27.000Z",
    "hittedKeywords": []
  },
  {
    "postId": "79485417",
    "postTitle": "Solution Architect (.Net)",
    "postUrl": "https://www.seek.com.au/job/79485417",
    "payRange": "$180K-$200K+Super+10% Bonus",
    "debugText": "Join a rapidly expanding Australian online betting company creating SAAS products for the online gambling industry! You will lead the architecture for a greenfield project. This is a fully remote position, but you have the option to go into their office as well.\n\n**Responsibilities:**\n\n- Design and develop architectural solutions for various projects\n- Develop detailed architectural blueprints and documentation to guide development teams and stakeholders\n- Present architectural plans and solutions to product stakeholders, facilitating discussions and incorporating feedback\n- Work closely with team leads to ensure architectural solutions align with project goals and team capabilities\n- Plan and oversee the integration of new systems with existing infrastructure, ensuring seamless operation and minimal disruption\n- Analyze and improve system performance, scalability, and reliability, ensuring solutions meet quality standards\n\n**Requirements:**\n\n- 3+ years experience as a Solution Architect\n- A strong background in software development with a deep understanding of software architecture principles\n- Extensive experience across .NET, React (or Angular), MongoDB and cloud platforms such as Azure and/or AWS\n- Demonstrated experience with Microservices Architecture (MSA), Service-Oriented Architecture (SOA), and/or Event-Driven Architecture\n- Strong analytical and problem-solving skills, with the ability to address complex technical challenges",
    "score": 10.377697952091694,
    "role": "Engineering - Software (Information & Communication Technology)",
    "workType": "Full time",
    "companyDetail": {
      "referenceId": "400458652",
      "name": "DeVision Recruitment",
      "linkedin": "https://guce.yahoo.com/terms?locale=en-AU",
      "description": "DeVision is an Australian based Consultancy that specialises in Software Engineering, Cloud/DevOps, Infrastructure & QA recruitment .  Companies that we work with we consider ‘partners’ rather than  %%U+0027%% clients %%U+0027%%  as we help them achieve their vision. Various industries that we have placed people into are Gaming, Health Care, Crypto Currency, Travel, Finance, SaaS and Consumer markets to name a few. \n\nOur core Values: \n1. Quality Service: This is our true differentiator in the market. Our turnaround time from taking a job brief to providing a shortlist, averages 48 hours.\n2. Transparency: We’re highly transparent with both clients and candidates. We’re not afraid to tell clients that their hiring process is suboptimal or that their offering isn’t good enough to attract the level of talent they’re after. Similarly, we’ll happily educate candidates that their expectations are unrealistic in conjunction with their level of experience, or that their CV is poorly written and needs improvement. \n3. Integrity: Integrity is massive for us as we want to foster long-term relationships with both clients and candidates. For clients, we establish a partnership model and only send candidates we genuinely feel will be an asset for their business. Candidates are happy to work with us again as we always have their best intentions in mind.\n\nThe following are positions that we fill (all levels- Graduates to Leads/Principals):\n✅ - Software Engineers (FE, BE & FS): .Net, Java, JavaScript (NodeJS, Typescript), PHP, Ruby, Python, \n Golang React, Angular, Vue, vanilla JavaScript (Html, CSS), Typescript, C++\n✅ -Firmware/Embedded Engineers, Unity Developers, 3D Developers\n✅ - Mobile Engineers: iOS, Android, React Native\n✅ - Cloud/DevOps/SRE Engineers: Continuous Integration, Deployment Leads, Microservices, AWS, \n Azure, GCP\n✅ - Infrastructure: Systems/Network Engineers, Service Desk Analysts, Security Engineers, Architects \n✅ - QA/Test Engineers: Automation/Manual\n\ndevsionrecruitment.com.au",
      "industry": "Staffing and Recruiting",
      "headQuarters": "Sydney, NSW",
      "lastUpdate": "2024-10-23T11:38:26.242946793+00:00",
      "url": "",
      "jobPosted": 0,
      "groupSize": "SIZE_A",
      "specialties": [],
      "locations": ""
    },
    "locations": "Sydney NSW",
    "expiringDate": "2024-11-13T05:47:00.000Z",
    "hittedKeywords": []
  },
  {
    "postId": "79691865",
    "postTitle": "Senior Architect",
    "postUrl": "https://www.seek.com.au/job/79691865",
    "debugText": "**The company** This is a rare and exciting opportunity with a boutique sized Sydney-based Architectural practice, who specialise in heritage projects.\n\n**The role**\n\nAn immediate opportunity exists for a skilled Senior Architect to provide technical expertise, through managing the client and delivering a high level of construction documentation packages.\n\n\nThe following are required:\n\n- A minimum of 7-10 years experience post graduation\n- Experience running projects as a Project Architect or Senior Architect\n- Experience understanding council controls, can measure accurately and is used to proposing design options and alternatives\n- You will be a skilled user of ArchiCAD\n- Ideally a quiet achiever\n- A passion for design\n- Knowledge of BCA standards\n- Must have strong Construction Documentation\n- Join a busy team which has an excellent market reputation and has a solid number of confirmed projects. The practice has a friendly and collaborative working culture and it believes in achieving a work life balance.\n\nIf you are an experienced Senior Architect actively seeking a new role or interested in having a confidential chat regarding the role please apply now or call David Hailame on\n(02) 8079 0980.\n\nEmail your portfolio to\n**david.hailame@acrworld.com**",
    "score": 10.059522829949856,
    "role": "Architecture (Design & Architecture)",
    "workType": "Contract/Temp",
    "companyDetail": {
      "referenceId": "1804630",
      "name": "ACRWORLD",
      "linkedin": "https://guce.yahoo.com/terms?locale=en-AU",
      "description": "Since 2001 we have been recruiting professionals across Architecture, Building, Property, Defence, Manufacturing, Transportation, Renewable Energy & Resources.\n\nAcquired by the Morson Group in 2022, we are one of Australia’s larger architecture, engineering, construction and property agencies, with an impressive track record in securing talent in an ever evolving and competitive marketplace.\n\nUnique database of more than 500,000+ candidates.\n5000+ placements made.\nSuccessfully placed personnel in 58 countries.\nWhite collar & blue collar roles.\nIndustry experts.\n\nServices include:\n\n- RPO\n- MSP\n- Permanent Placements \n- On Hire Contractors (Payroll) \n- Executive Search (Retained) \n- Project Recruitment Outsourcing \n\nRecruitment Consultants who listen, consult, compete and deliver.\n\nContact us today to see how we can effectively compete for you.",
      "industry": "Staffing and Recruiting",
      "groupSize": "SIZE_C",
      "headQuarters": "Sydney, NSW",
      "specialties": [
        "Engineering Jobs",
        "Construction Jobs",
        "Oil & Gas Jobs",
        "Building Jobs",
        "Property Jobs",
        "Power Jobs",
        "Infrastructure Jobs",
        "Rail Jobs",
        "Mining Jobs",
        "Executive Search",
        "Permanent Placement",
        "On Hire contractors",
        "Project Recruitment Outsourcing",
        "International Recruitment",
        "Architecture Jobs",
        "Renewable Energy",
        "RPO",
        "and MSP"
      ],
      "lastUpdate": "2024-10-23T13:23:05.943245130+00:00",
      "url": "",
      "jobPosted": 0,
      "locations": ""
    },
    "locations": "Sydney NSW",
    "expiringDate": "2024-11-22T01:00:00.000Z",
    "payRange": "",
    "hittedKeywords": []
  },
  {
    "postId": "79220260",
    "postTitle": "TIBCO Integration Technical Architect/Lead",
    "postUrl": "https://www.seek.com.au/job/79220260",
    "debugText": "**TIBCO Integration Technical Architects**\n\n**Location:** Sydney, Australia\n\n**Contract:** 6-month initial contract with view to extend\n\nWe are seeking an experienced\n**Development Lead / Architect**\nwith deep expertise in\n**TIBCO ActiveMatrix BusinessWorks™ 5.14.0**. In this senior-level role, you will be responsible for architecting integration solutions and leading the development team to deliver innovative and scalable business process automation projects. You will act as a technical leader, guiding best practices, architectural decisions, and ensuring smooth implementation across multiple integration initiatives.\n\n**Key Responsibilities:**\n\n- **Architectural Leadership:**\nDesign and architect complex integration solutions using TIBCO ActiveMatrix BusinessWorks™ to meet business needs and ensure seamless communication across enterprise systems.\n- **Team Leadership:**\nLead a team of developers, providing mentorship, guidance, and support in developing high-quality integration processes.\n- **Integration Strategy:**\nDevelop and implement best practices, frameworks, and methodologies for TIBCO integration projects.\n- **Solution Design:**\nCollaborate with business and technical stakeholders to design scalable, efficient, and cost-effective integration solutions.\n- **Technical Oversight:**\nEnsure the technical integrity of integration projects, including security, performance, scalability, and compliance with enterprise standards.\n- **Process Optimization:**\nContinuously improve existing integration systems by optimizing architecture, performance, and automation capabilities.\n- **Stakeholder Management:**\nWork closely with clients, business analysts, and project managers to understand project requirements and provide regular progress updates.\n- **Documentation:**\nDevelop high-level technical documentation, including solution architectures, data flows, and integration specifications.\n\n**Required Skills and Qualifications:**\n\n- **Experience:**\n  - 7+ years of experience in enterprise integration and middleware solutions, including extensive experience with\n**TIBCO ActiveMatrix BusinessWorks™**.\n  - Proven track record in\n**architecting**\nand delivering successful integration projects within complex enterprise environments.\n  - Experience with\n**TIBCO EMS, JMS, SOAP/REST Web Services**, and other related technologies.\n  - Knowledge of\n**cloud-based integration**\nsolutions, especially with AWS or GCP, is highly desirable.\n- **Leadership Skills:**\n  - Strong leadership, team management, and mentoring skills.\n  - Ability to make strategic decisions and influence architectural direction across projects.\n- **Technical Expertise:**\n  - Advanced proficiency in designing and developing integration solutions using TIBCO BusinessWorks and related TIBCO products.\n  - Strong background in\n**enterprise architecture**, system integration, and business process automation.\n- **Communication Skills:**\n  - Excellent communication and interpersonal skills with the ability to engage and influence stakeholders at all levels.\n\n**Preferred Qualifications:**\n\n- TIBCO certifications or relevant architecture certifications are a strong advantage.",
    "score": 9.894975036382675,
    "role": "Consultants (Information & Communication Technology)",
    "workType": "Contract/Temp",
    "companyDetail": {
      "referenceId": "61887107",
      "name": "The Aquarium",
      "linkedin": "https://guce.yahoo.com/terms?locale=en-AU",
      "description": "The Aquarium is a Professional Services Group comprised of The Aquarium Talent Solutions, The Aquarium Professional Services, Consortio and Total Resource Solutions.\n\nWe are an established and highly successful talent provider to corporates, government and growing businesses. With over 2,000 individuals deployed across a wide range of clients, we have an unrivalled access to talent throughout Australia and through multiple off-shore channels. Our engagement services provide improved visibility over contractor logistics, promote efficiency and process improvement and reduce employment-associated risk.\n\nCombining over 50 years of experience in the Talent and Professional Services industry, The Aquarium are a highly-reputable group who provide exceptional service with a personable approach. Our services are agile—designed to be scalable and customisable— ensuring that we can easily adapt to changing circumstances and deliver first-class results.\n\nInnovation is a key component of our approach, as we continue to push the boundaries to find new and creative solutions to the challenges faced by our clients. We are not afraid to approach solutions from an alternate angle: we are constantly looking for new ways to help our clients achieve their goals faster and more efficiently.",
      "industry": "Professional Services",
      "groupSize": "SIZE_B",
      "headQuarters": "Haymarket, New South Wales",
      "specialties": [
        "Professional Services",
        "Recruitment",
        "Payroll",
        "Teams As a Service",
        "Contingent Workforce",
        "Engagement",
        "and Technology Services"
      ],
      "lastUpdate": "2024-10-23T13:23:19.616942804+00:00",
      "url": "",
      "jobPosted": 0,
      "locations": ""
    },
    "locations": "Sydney NSW",
    "expiringDate": "2024-11-01T00:45:00.000Z",
    "payRange": "",
    "hittedKeywords": []
  },
  {
    "postId": "79440610",
    "postTitle": "Application Architect",
    "postUrl": "https://www.seek.com.au/job/79440610",
    "payRange": "Market rates",
    "debugText": "**Digital Solution Architect**\n\nFinXL IT Professional Services is currently looking for a Digital Solutions Architect to work on site with their client to deliver the quality digital solutions. This would be a hands on technical role.\n\n- Initial 6 months contract with extensions\n- Sydney Based\n- Hybrid working (3 days in office)\n- Immediate or 2 weeks notice preferred\n\n**Skills Required:**\n\n- Must have strong experience with Digital projects and delivering digital projects.\n- Must come from a developing background and experience in online design and architecture.\n- Systems integration experience.\n- experience with API, micro-services, Linux and web services preferred.\n- Experience with Digital technologies include: Mobile applications, web frameworks, Marketing and call centre.\n- Experience negotiating scope\n- Strong stakeholder management\n- Experience working along with the other teams to deliver the continuous integration and delivery.\n- Experience working in cloud environments.\n- Experience working in BAU projects.\n- Strong experience with agile methodologies.\n\n**Responsibilities**:\n\n- Responsible for delivering solution design and architecture across different digital channels.\n- Investigating new technology solutions where appropriate and developing prototypes.\n- Responsible for managing project changes and impact assessments.\n- Responsible for ensuring architecture and solution are aligned with the rest of the teams.\n- Establish and maintain trusting and valuable professional relationships with other team members.\n- Establish alignment with Architecture best practices and Architecture Reference Architecture.\n- Development of requirements that accurately reflect the capabilities and strategic direction of the systems and the needs of the business.\n- Team player - Good relationship with all team members and any third parties.\n- Technical leadership - Coach and lead developers towards the right solution.\n- Agile Principles.\n- Operational Quality - All designs and implementation are stable, high quality and are easy to operate and monitor.\n- Documentation and Compliance\n- Performance Optimisation\n\nIf you are someone with the following skills, Please apply through the link below and we will get in touch with the suitable candidates.",
    "score": 9.880283504724503,
    "role": "Architects (Information & Communication Technology)",
    "workType": "Contract/Temp",
    "companyDetail": {
      "referenceId": "45561458",
      "name": "FinXL IT Professional Services",
      "linkedin": "https://guce.yahoo.com/terms?locale=en-AU",
      "description": "FinXL IT Professional Services – part of the Finite Group - is a proudly Australian company known for delivering high value ICT services and solutions.\n\nFinXL was established in 2003 and has an international presence with eight offices across Australia and New Zealand. As a trusted partner, we consistently deliver excellence and value to our clients.\n\nOur outcome driven approach is achieved by combining exceptionally talented people with proven methodologies to deliver innovative and pragmatic solutions. This enables our clients to increase revenue and profitability, improve customer satisfaction and engagement and stay ahead in today’s rapidly changing world.\n\nWe have provided ICT Professional Services to a diverse range of medium to large enterprises and government organisations, including many ASX 200 corporations. Some of our key industries include: \n\n> Telecommunications \n> Government – Federal, State and Local \n> Banking and Financial Services \n> Commercial \n> Utilities and Resources \n> Defence\n\nWe currently have more than 1000 consultants assisting our clients throughout Australia and New Zealand, and we continue to grow at a rapid pace.\n\nThrough the delivery of services and implementation of new systems, processes and technology, we assist our clients to gain competitive advantage and reach new heights! \n\nPlease call us to discover why more and more clients are using FinXL.\n\nFinXL. Expert Services. Trusted Delivery.",
      "industry": "IT Services and IT Consulting",
      "groupSize": "SIZE_D",
      "headQuarters": "Sydney, NSW",
      "specialties": [
        "Business Consulting Services",
        "Project Services",
        "Information Services",
        "Managed Services",
        "Solution Services",
        "Technical Services",
        "Project Management",
        "Business Analysis",
        "Architecture",
        "Change Consulting",
        "Systems Integration",
        "Application Development",
        "and Flexible Workforce"
      ],
      "lastUpdate": "2024-10-23T11:41:48.785685637+00:00",
      "url": "",
      "jobPosted": 0,
      "locations": ""
    },
    "locations": "Sydney NSW",
    "expiringDate": "2024-11-10T01:49:37.000Z",
    "hittedKeywords": []
  },
  {
    "postId": "79394213",
    "postTitle": "Solutions Architect - Applications Migration",
    "postUrl": "https://www.seek.com.au/job/79394213",
    "debugText": "Consulting opportunity to provide solutions architecture architecture expertise to support a major separation program\n\n**The role**\n\n- As the Solutions Architect for the applications migration stream you will be responsible for defining the approach, dependancies , sequencing, solutions design for all business applications in scope\n- You will work collaboratively with stakeholders, architects, engineers and vendors to validate appropriate solutions and provide technical oversight and direction.\n\n**Your experience**\n\n- 10 years + industry experience\n- Proven technical architecture, design and deployment skills\n- Extensive experience as a Solutions Architect supporting complex separation / migration / divestment programs\n- Broad technical knowledge across integration / cloud ( Azure) / data / security / etc\n- Ability to drive architectural and technical solutions\n- Excellent stakeholder relationship skills and ability to influence\n- Pragmatic approach and outcome focus are essential\n\nFor more information please apply today",
    "score": 9.798652559518814,
    "role": "Architects (Information & Communication Technology)",
    "workType": "Contract/Temp",
    "companyDetail": {
      "referenceId": "35737429",
      "name": "Rumble Asia Pty Ltd",
      "linkedin": "https://guce.yahoo.com/terms?locale=en-AU",
      "description": "Rumble is perfectly positioned to provide organisations with strategic technology consulting services that offer the right balance of quality and value.  Our background with major Australian and Asia Pacific companies provides a wealth of real-world experience that can be drawn upon to address the strategic challenges facing the modern IT organisation.  Engaging at all levels within the organisation and across key IT disciplines, Rumble consultants combine industry best practice with their expert skills and experience, to produce swift results that speak for themselves.",
      "industry": "IT Services and IT Consulting",
      "groupSize": "SIZE_B",
      "headQuarters": "CBD, NSW",
      "specialties": [
        "Consulting",
        "Technology Strategy",
        "Enterprise Architecture",
        "CIO Advisory",
        "Program Governance",
        "Program Delivery",
        "Technology Services",
        "Technology Delivery",
        "Business Transformation",
        "Mergers and Acquisitions",
        "Systems Integration",
        "Solution Architecture",
        "and Program Architecture"
      ],
      "lastUpdate": "2024-10-23T14:41:04.010183171+00:00",
      "url": "",
      "jobPosted": 0,
      "locations": ""
    },
    "locations": "Sydney NSW",
    "expiringDate": "2024-11-08T12:59:59.999Z",
    "payRange": "",
    "hittedKeywords": []
  },
  {
    "postId": "79691792",
    "postTitle": "Solution Architect",
    "postUrl": "https://www.seek.com.au/job/79691792",
    "debugText": "**Information Technology Unit: Architecture**\n\n At UTS, we’re changing the game. We’re on a journey to be the leading university of technology and we’re moving the world forward with our breakthroughs. Our state-of-the-art campus in Sydney’s vibrant Tech Central precinct is a hub of creativity, innovation, and collaboration, where curiosity thrives.\n\n As we transform our Digital Strategy, we’re modernising and adopting Agile methodologies, including the SAFe framework, to boost efficiency and responsiveness.\n\n You’ll be joining a supportive and inclusive community that values diverse perspectives and encourages you to bring your whole self to work.\n\n Ready to make a difference? Join us at UTS and help shape the future!\n\n The Architecture Practice at UTS is driven by a passion for enabling exceptional customer experiences for students, academics and professional staff. The team has deep knowledge of UTS and strong relationships across IT and business. They work closely with people across UTS to build a compelling technology vision, a clear pathway to get there, and shape the solutions to make it real! As a team, they value forward-thinking, collaboration, trust, clear communication and bringing new ideas to the table – and seek to live these values every day.\n\n Team members shape innovative solutions that directly contribute to the University %%U+0027%% s core purpose of advancing knowledge and learning through research-inspired teaching, research with global impact, and partnerships with industry, the professions and community. They are encouraged to bring new ideas for improving the way we work and share knowledge and learnings across ITU. Ongoing development is seen as critically important in this team with members committing to training outcomes in annual work plans and time reserved each month for upskilling. The architecture practice also embraces flexible working, typically spending a minimum of 2 days on campus each week with one of those days being the team  %%U+0027%% anchor day %%U+0027%%  when all team members have an opportunity to meet up face to face.\n\n**The Opportunity**\n\n The Solution Architect role is a key position within the IT Unit. The Solution Architect will design and deliver effective technology solutions that align with UTS %%U+0027%% s strategic goals and enterprise architecture framework. This role requires a deep understanding of business requirements, technical expertise, and the ability to translate them into scalable and robust solutions.\n\n**A Day in the Life of a Solution Architect at UTS**\n\n The architectural landscape at UTS is broad, complex and quickly evolving. Solution Architects will typically be aligned to particular business-focused or architecture-focused domains (e.g. business, information, data, integration, infrastructure, cloud, security etc). For the current advertised roles, the position holder will work in one or more of the below domains. Key technologies for each domain are also outlined below. While it is not essential to be an expert in all these technologies, an understanding of the fundamentals is desirable.\n\nBusiness Operations Technology:\n\n- Optimizely\n- Google Analytics 4\n- Salesforce CRM & Marketing cloud\n- Raisers Edge\n- SharePoint Online\n- Ascender/Concur\n\n Enterprise Platforms:\n\n- ServiceNow\n- Workday ERP\n- Microsoft 365 & Power Platform\n- Protecht, Riskware\n- Boomi\n\n Cloud and Infrastructure – Faculty Specialist Systems:\n\n- Cloud Infrastructure & Platforms (AWS, GCP, Azure)\n- Enterprise Observability (New Relic)\n- Identity Security & Governance (Okta & Sailpoint)\n- Enterprise Storage (Dell PowerScale)\n- DevOps & CI/CD Tools (GitHub, Terraform, Ansible)\n- Data Networking\n\n**What You’ll Need to Succeed**\n\n- Proven experience working as a Solution Architect, Technical Lead or in a similar role, preferably in a large and complex organization.\n- Solid understanding of enterprise architecture principles, frameworks (e.g., TOGAF), modelling techniques and solution design methodologies. Relevant certifications such as TOGAF, SAFe, or similar are desirable.\n- Strong technical expertise in multiple domains, such as application development, integration, information and data management, security, or infrastructure.\n- Experience in designing and implementing solutions using industry-standard technologies and platforms.\n- Proficiency in creating architectural artifacts, such as architecture models, specifications, and design patterns.\n- Knowledge of security and compliance considerations in solution design.\n- Excellent analytical and problem-solving skills, with the ability to assess complex requirements and translate them into practical solution architectures.\n- Strong interpersonal and stakeholder management skills, with the ability to build effective relationships and collaborate with diverse teams.\n- Demonstrated experience working collaboratively within cross-functional agile teams.\n\n**Remuneration & Benefits**\n\nA competitive and comprehensive remuneration package will be offered.\n\n This role attracts 17% superannuation in addition to the base salary.\n\n UTS staff also benefit from a wide range of Employee Benefits. We prioritise your growth with extensive learning and development opportunities, including leadership programs, study time support, and access to resources like LinkedIn Learning. Enjoy a comprehensive health and wellbeing package featuring on-campus health services, fitness discounts, and childcare support. Financially, we offer competitive benefits, including salary packaging options, and exclusive discounts on various products and services. Plus, benefit from generous leave entitlements and staff recognition programs that celebrate your achievements.\n\n We have three full-time positions available.\n\n**How to Apply**\n\n- **Please submit your application with your updated Resume (max 5 pages) and a Cover Letter (max 2 pages) outlining your skills and capability in relation to the role. Only applications that include a cover letter will be accepted.**\n- Specific enquiries or issues with your application may be directed to the UTS Recruitment Team at ITOM.recruitment@uts.edu.au.\n- Applicants must have current and valid work rights in Australia.\n- **Please note that applications for this position will close on Wednesday, 6 November 2024.**\n\n**Accessibility**\n\n UTS Recruitment care about digital accessibility. If there is any content in our advertising that you have struggled with, please make us aware so that we can make our information accessible to all.\n\n_In addition, if you have a disability that requires adjustment to the recruitment process or an alternative application pathway please contact ITOM.recruitment@uts.edu.au for assistance._\n\n_UTS is recognised widely as supporting inclusivity and diversity through our Wingara Indigenous Employment Strategy, Social Impact Framework and UTS Access and Inclusion Plan. Cited as a WGEA Employer of Choice since the inception of the award, we were among the first Australian institutions to receive the Athena SWAN Bronze Accreditation for our commitment to action addressing gender equity in the STEMM disciplines._\n\n_We welcome applications from women, Indigenous Australians, people with disability, those who identify as LGBTIQ and applicants from culturally and linguistically diverse backgrounds._",
    "score": 9.707138188183308,
    "role": "Architects (Information & Communication Technology)",
    "workType": "Full time",
    "companyDetail": {
      "referenceId": "432656",
      "name": "UTS",
      "url": "https://recruitment.uts.edu.au/",
      "linkedin": "https://guce.yahoo.com/terms?locale=en-AU",
      "description": "Our campus is in the heart of Sydney %%U+0027%% s creative and digital precinct and alongside Sydney %%U+0027%% s central business district and Central train station.\nAfter a 10-year $1.3 billion transformation of the UTS campus, the university boasts a range of award-winning and sustainably-built buildings and facilities designed to support innovation in education and research.",
      "industry": "Education & Training",
      "headQuarters": "Ultimo, New South Wales",
      "lastUpdate": "2024-10-23T11:40:40.292382883+00:00",
      "jobPosted": 0,
      "groupSize": "SIZE_A",
      "specialties": [],
      "locations": ""
    },
    "locations": "Sydney NSW",
    "expiringDate": "2024-11-06T00:57:00.000Z",
    "payRange": "",
    "hittedKeywords": []
  },
  {
    "postId": "79470244",
    "postTitle": "Project Architect",
    "postUrl": "https://www.seek.com.au/job/79470244",
    "debugText": "**About the role**\n\nAs a Project Architect at MJ Suttie Architects, you will play a pivotal role in the design and delivery of beautiful architectural projects. Joining our team in our Potts Point office, you will collaborate with clients, project managers, and multidisciplinary teams to bring our architectural visions to life. This full-time position offers the opportunity to contribute to the strategic direction of the practice and make a lasting impact on the built environment.\n\n**What you %%U+0027%% ll be doing**\n\n- Lead the design process for assigned projects, from concept to construction\n- Prepare detailed design drawings, specifications, and documentation\n- Manage project budgets and timelines to ensure successful delivery\n- Liaise with clients, consultants, and local authorities to coordinate project requirements\n- Mentor and provide guidance to junior architects and technicians\n- Contribute to the firm %%U+0027%% s business development and marketing initiatives\n\n**What we %%U+0027%% re looking for**\n\n- Degree in Architecture and registration as a Practicing Architect\n- Minimum 5 years of post-graduate experience in a similar role\n- Strong technical skills in design, documentation, and project management\n- Excellent communication and interpersonal skills to effectively collaborate with clients and stakeholders\n- Passion for beauty and timeless architecture\n- Ability to work independently and as part of a dynamic team\n- Skill set includes: Revit, CAD, Hand Drafting, Enscape etc.\n\n**What we offer**\n\n- Competitive remuneration and performance-based bonuses\n- Opportunities for professional development and career progression\n- Flexible work arrangements to support work-life balance\n- A vibrant and collaborative work environment in CBD\n\n**About us**\n\nMJ Suttie Architects is a Classical and Traditional Architect firm with a reputation for delivering exceptional architectural solutions. Our team of talented professionals is committed to creating inspired and sustainable buildings that enhance the lives of the people who use them.\n\nApply now to join our team and take the next step in your architectural career.",
    "score": 9.208301313221455,
    "role": "Architecture (Design & Architecture)",
    "workType": "Full time",
    "companyDetail": {
      "referenceId": "55497740",
      "name": "MJ Suttie Architects",
      "linkedin": "https://guce.yahoo.com/terms?locale=en-AU",
      "description": "M.J.Suttie Architects offers services in both architecture and urban design. M.J.Suttie Architects seeks to create timeless architecture and urban spaces through an understanding and openness to the classical and vernacular traditions and contemporary construction techniques.",
      "industry": "Architecture and Planning",
      "headQuarters": "Albury",
      "lastUpdate": "2024-10-23T13:23:17.062051802+00:00",
      "url": "",
      "jobPosted": 0,
      "groupSize": "SIZE_A",
      "specialties": [],
      "locations": ""
    },
    "locations": "Potts Point, Sydney NSW",
    "expiringDate": "2024-11-12T12:59:59.999Z",
    "payRange": "",
    "hittedKeywords": []
  },
  {
    "postId": "79705062",
    "postTitle": "Solution Architect",
    "postUrl": "https://www.seek.com.au/job/79705062",
    "debugText": "Osborne Richardson specialise in public-sector recruitment. Our IT division is headed up by an experienced IT project manager so, when you work with us, you will be working with someone understands your requirements based on real-world experience.\n\n- To 30 Jan 25\n- $1000/day + Super\n- CBD / Hybrid\n- Immediate start\n\n**About the role:**\n\nThe Solution Architect will join a NSW state government department to undertake the development of a SAD and a cost estimate for the implementation of a data solution to replace manual collection of data to multiple local data sources to an automated system leveraging the existing data storage solution.\n\n**Key Responsibilities:**\n\n- Develop a Solution Architecture Document\n- Propose technologies to meet requirements\n- Obtain endorsement of the SAD\n- Develop and obtain endorsement for an implementation cost estimate\n\n**Experience:**\n\n- Significant experience developing Solution Architectures for data collection, validation, management and consumption.\n\nThank you for your interest. We regret that, due to the number of applications received, we will not be able to respond to all applicants.",
    "score": 8.978305220603943,
    "role": "Architects (Information & Communication Technology)",
    "workType": "Contract/Temp",
    "companyDetail": {
      "referenceId": "30755661",
      "name": "Osborne Richardson",
      "linkedin": "https://guce.yahoo.com/terms?locale=en-AU",
      "description": "Osborne Richardson is one of Australia %%U+0027%% s leading professional Government, IT and Food Manufacturing recruitment consultancies, specialising in the placement of permanent and contract staff across all levels of seniority.\n\nOur strategy to focus exclusively within our niche disciplines allows us to concentrate on the requirements of our clients and fully understand their needs. That in-depth sector and market knowledge is vital, enabling us to deliver successful and swift recruitment outcomes. We have achieved that degree of understanding by building meaningful relationships with leading organisations in the public and private sector and an extensive network of industry professionals allowing our consultants to put forward potential recruits that have the most relevant experience and personal qualities to fulfill clients %%U+0027%%  requirements\n \nAreas of Specialisation:\n\nGovernment\n\nWe have a highly experienced and exceptionally passionate team, who bring over 50 years of combined Government recruitment experience between them. Our ever expanding networks and proximity to the market means we are able to act swiftly, delivering successful outcomes for both clients and candidates.\n \nFood Manufacturing\n\nWithin Osborne Richardson’s Food Manufacturing division, we have dedicated consultants focused solely on recruiting within specific disciplines serving the food manufacturing industry throughout Australia. \n \nInformation Technology\n Osborne Richardson IT is a specialist division operated by a team of skilled recruiters and IT subject matter experts with over 20 years’ experience in the Queensland ICT market.  We deliver business critical ICT contract and permanent recruitment projects for local and state government departments, and blue chip corporates operating across every Queensland Industry. \n \nAs experienced Program, Project, and technical specialists we can help employers assess their IT recruitment requirements and to find the best fit candidates for each role.",
      "industry": "Human Resources Services",
      "groupSize": "SIZE_B",
      "headQuarters": "Brisbane, QLD",
      "specialties": [
        "Food Manufacturing Industry Expertise",
        "Industry Knowledge",
        "Strong Industry Network",
        "Experienced Consultants",
        "Reliable and Reputable",
        "Quality Service",
        "Authentic Working Relationships",
        "and Focused Strategy"
      ],
      "lastUpdate": "2024-10-23T13:23:15.148664301+00:00",
      "url": "",
      "jobPosted": 0,
      "locations": ""
    },
    "locations": "Sydney NSW",
    "expiringDate": "2024-11-22T12:59:59.999Z",
    "payRange": "",
    "hittedKeywords": []
  },
  {
    "postId": "79653065",
    "postTitle": "Documentation Architect/ Project Architect",
    "postUrl": "https://www.seek.com.au/job/79653065",
    "debugText": "**Who We Are**\n\nPBD Architects is a Sydney-based design driven architecture practice which has an outstanding client base across residential and commercial projects – we have successfully delivered a wide range of innovative architectural and interiors projects in residential, commercial, seniors living, aged care, master planning and hospitality.\n\nOur general ethos is a balance between quality architecture, efficient planning and interior design which meets the needs of the intended target audience.\n\n**What We Want**\n\nWe are currently seeking a Documentation Architect/ Project Architect to join our practice to develop and maintain strong relationships with clients, executives, and other key stakeholders to help guide and deliver projects. You will be responsible for the day-today input and coordination of project components, including concept design and documentation.\n\nYour role will include:\n\n- Develop, understand, and interpret design concepts, ensuring all designs are reflective of the design strategy and PBD vision\n- Work cooperatively and communicate with your Project Leader, client and consultants to deliver the projects\n- Prepare client and consultant team update\n- Undertake Quality Assurance procedures, checking and issuing of documents\n- Prepare detailed design documentation for a wide range of creative projects\n\n**Who You Are**\n\nThe ideal candidate will bring the following skills to this role:\n\n- 7 years of local architectural experience\n- Registered Architect in Australia\n- Strong knowledge of the methods and techniques of CAD design\n- High level of technical expertise to guide and deliver multi-unit residential projects\n- Experience In design concepts, design delivery, drawing and drafting\n- Ability to review, analyse, and make recommendations regarding designs, plans and specifications\n- Advanced knowledge of all applicable codes and regulatory agency guidelines\n- Strong written and verbal communication skills\n- Ability to communicate effectively with stakeholders\n\nOur technology suite includes:\n\n- Archicad\n- Enscape/\nLumion\n- Adobe Suite\n\n**What We offer**\n\nAs a member of our vibrant office, you will have the\nopportunity to work with alongside your team members on the full project cycle\nfrom concept through to completion. This is a great opportunity to join a practice\nthat prides itself on its support and commitment to its staff, dynamic results, ongoing training, and internal career growth.\n\nSome of the perks of working at PBD Architects:\n\n- A highly competitive salary plus performance bonuses\n- Newly renovated office spaces in Surry Hills\n- An amazing Surry Hills location, where the food and coffee options are endless and delicious\n- Seminars, design workshops and team building activities\n- Socials - Friday night drinks, birthday celebrations, lunches, fitness training sessions and our annual tennis tournament\n\nWe are looking for like-minded ambitious and creative people who would be a great cultural fit with our team.\n\nIf you are looking for a varied role, where you will be mentored by experienced professionals, please apply by submitting your application.\n\nPlease note, only shortlisted candidates will be contacted.\n\n_**If this sounds like you please submit your application and portfolio to\nhr@pbdarchitects.com.au**_",
    "score": 8.608927838504314,
    "role": "Architecture (Design & Architecture)",
    "workType": "Full time",
    "companyDetail": {
      "referenceId": "27831324",
      "name": "PBD Architects",
      "linkedin": "https://guce.yahoo.com/terms?locale=en-AU",
      "description": "Nominated Architect | Paul Buljevic | Registration No. 7768\n\nPBD Architects is a multi-disciplined design practice committed to creating buildings that meet objectives of the project brief and adhere to the highest Architectural standard.\n\nWith the experience and delivery capability to take projects through from inception to completion, PBD are often engaged to prepare initial feasibility studies on raw sites generating both a design concept and financial plan for building procurement.\n\nExperience within the PBD team stems from all facets of the construction industry including Design/ Architecture, Project/ Development Management, Contract Administration and Technical Support. This combined knowledge ensures a holistic approach to design and building procurement.\n\nDesign, cost and program are key commercial elements in what the team at PBD Architects and Project Managers consider an “integrated design process” where limitations of a project should be posed by the site and not its designer.\n\nWe are committed to providing an honest, reliable and personalized service in which meeting the financial and management goals of our clients become our primary concern.",
      "industry": "Architecture and Planning",
      "groupSize": "SIZE_B",
      "headQuarters": "Surry Hills, New South Wales",
      "specialties": [
        "Architecture Design",
        "Interior Design",
        "Masterplanning",
        "Project Management",
        "and Feasibility Studies"
      ],
      "lastUpdate": "2024-10-23T13:23:09.007021632+00:00",
      "url": "",
      "jobPosted": 0,
      "locations": ""
    },
    "locations": "Surry Hills, Sydney NSW",
    "expiringDate": "2024-11-21T12:59:59.999Z",
    "payRange": "",
    "hittedKeywords": []
  },
  {
    "postId": "79545888",
    "postTitle": "SAP BASIS Technical Architect - ECC to S/4 HANA",
    "postUrl": "https://www.seek.com.au/job/79545888",
    "debugText": "The SAP Technical Architect should have a strong Basis background and will be responsible for documenting and sequencing the necessary readiness activities for the uplift and Technical Conversion of SAP ECC to S/4HANA. The\n\nSAP Technical Architect will require similar experience from at least 2-3 prior SAP upgrades from ECC6 to S/4HANA especially focussed in the HCM and Finance domains.\n\n**To Be Successful in this role, you must have:**\n\nMinimum 5 years of experience in all facets of SAP Technical Architecture at a senior level. This includes having\n\n- a strong SAP Basis background to drive and develop the necessary architectures associated with SAP Environments, Data and Interfaces to other Corporate Systems. **Candidates must have a minimum of 2-3 ECC6 to S/4HANA** Upgrade projects with an emphasis of working with SAP to develop the Code and Data Readiness Assessments needed prior to execution of the upgrade.\n- \nThe Candidate will require exceptional written and communication skills as there will be a need to facilitate workshops and conduct presentations at senior levels of the organisation.\n- Demonstrated experience working with project as the SAP Technical Architect to deliver successful outcomes in SAP S/4 HANA and other related Enterprise applications is essential.\n- Experience is on the SAP Upgrade from ECC to SAP S/4 HANA with impact assessment, discovery and solution delivery of the upgrade roadmap is essential. Experience with managing impact and technical assessment of the SAP environments for a minimum of 2 SAP upgrade projects is mandatory.\n- It is recommended that the Candidate showcase their delivery experience with emphasis in facilitating workshops and developing comprehensive architecture storyboards to present to executive leadership. Their experience should demonstrate sound knowledge on how an organisation needs to get ready for a SAP technical upgrade from on-premise ECC6 to a S/4HANA Cloud environment (AWS or Azure).\n\n**Some of the Key Roles the Successful candidate will perform:**\n\n- The SAP Technical Architect will undertake the analysis of current and planned SAP technical architecture deliverables ensuring alignment with stakeholder and customer needs through formal workshops and presentations.\n- The SAP Technical Architect maintains and will take ownership in developing and documenting the current and future state SAP architectures for acceptance and handover to the SAP Platform Owner and BAU Team. This role involves the development of architectures, technical designs, data flow diagrams, Interface Architectures and other products to support the upgrade to S/4HANA.\n- Strategic alignment is crucial, ensuring solutions align with the organization %%U+0027%% s strategic direction for technology investments.\n- The SAP Technical Architect may also need to liaise with third parties and vendors/suppliers for the allocation of technical readiness activities.\n\n If this sounds like the opportunity you have been looking for, please APPLY NOW or call Medha at 0488681159 for a confidential discussion.\n\n**This is a Sydney based role and only open to Australian Citizens and Permanent Residents only**",
    "score": 7.810579985380173,
    "role": "Architects (Information & Communication Technology)",
    "workType": "Contract/Temp",
    "companyDetail": {
      "referenceId": "28020053",
      "name": "Torch Professional Services Pty Ltd",
      "linkedin": "https://guce.yahoo.com/terms?locale=en-AU",
      "description": "Torch Professional Services Pty Ltd commenced trading in 2013 with a market knowledge developed over 30 years; our focus is to connect organisations with IT Professionals who can help them gain increased value and a competitive edge through the effective use of technology.  Our expertise comes from years working side by side with the top telecommunication, retail, government bodies and utilities companies in Australia but also  small to medium locally owned organisations in both the private and public sectors.\n\nTorch Professional Services are specialists within project delivery and have quickly become among the most successful contingent labour and project services suppliers.  We understand the nature of the IT industry and our agile approach has allowed us to enjoy enormous success as a result.  We understand the unique skill sets required to be valuable contributors to our customer teams.  We are most comfortable on large transformations which are fast paced and often ambiguous environments.  Our experience and exhaustive list of contacts means we understand your needs and we deliver!   \n \nTorch has an outstanding reputation for providing the best people to many of Australia %%U+0027%% s largest organisations.  Torch uses smart technologies to enable us to manage large volumes of project teams for our clientele, while still remaining very connected to our people and our customers.",
      "industry": "IT Services and IT Consulting",
      "groupSize": "SIZE_B",
      "headQuarters": "Parramatta, New South Wales",
      "specialties": [
        "Permanent Recruitment",
        "Contract Recruitment",
        "Fixed Term Hire",
        "and Project Teams"
      ],
      "lastUpdate": "2024-10-23T13:23:21.990605388+00:00",
      "url": "",
      "jobPosted": 0,
      "locations": ""
    },
    "locations": "Sydney NSW",
    "expiringDate": "2024-11-15T06:00:00.000Z",
    "payRange": "",
    "hittedKeywords": []
  },
  {
    "postId": "79310455",
    "postTitle": "Architect (Transport)",
    "postUrl": "https://www.seek.com.au/job/79310455",
    "payRange": "Competative Salary Package",
    "debugText": "**Career Growth Opportunity:**\n\nWe are looking for an architect, ideally 5 to 7 years, who is looking for an opportunity to and play a leading role on projects, as the 2IC to a project leader / senior architect, work on projects end to end. You will get exposure to a great range of projects and an ability to grow within the organisation This role has come about due to the recent promotion the team member to a senior architect.\n\n This is a lovely studio to work in with genuine and caring directors who are professional and well-respected in the industry. You will have the ability to work on a range of projects on transport and infrastructure, and also able to work on complex technical buildings for government clients too.\n\n**About you:**\n\n You will have a good base, ideally 5 to 7 years and at least 1 year of doing transport project. This opportunity is for someone who is seeking an opportunity to step up, either by working on larger-scale projects or playing a more leading role. You will have an opportunity to work with clients, consultants and builders and be able to be the primary contact throughout projects.\n\n You could have experience in large or smaller-scale projects. It is important you have good Revit skills, Enscape and good visualisations would be useful too.\n\n**How to apply:** Press the\n“Apply”\nbutton and please submit:\n\n- Resume\n- Folio (attach instead of Cover Letter attachment (2MB limit)\n\n_Please Submit your application through “Apply”, as this goes directly into our system and ensures you will be considered. Emailing us means we have to add you in separately and this may not be considered as promptly._\n\n_If your folio is too large please submit your resume and then email your folio to people@buildpx.com.au as this will enable us to add your folio to your application._\n\n We will be reviewing applications over the coming week, so please submit your interest asap.\n\n We look forward to receiving your interest\n\n**Our Process**\n\n We will review resumes and folios and contact candidates with the relevant skills and experience for a quick phone conversation to gain better insights into you, your skills and experience, and your interest in the role. Following this, we will short-list candidates for a 30 min online interview and then will arrange final interviews with our client with the top short-listed candidates.\n\n**Contact Us**\n\n If you have any questions, please feel free to email\nus at\npeople@buildpx.com.au **Not right for you, Other Opportunities:** We work with a range of clients nationally, so if this role is not right for you and you are looking feel free to express your interest in opportunities by registering with us via email at people@buildpx.com.au\n\n**Find out more about us and what we do at:**\n\n BuildPx.com.au",
    "score": 7.3360965847969055,
    "role": "Architecture (Design & Architecture)",
    "workType": "Full time",
    "companyDetail": {
      "referenceId": "61675552",
      "name": "Build PX",
      "linkedin": "https://guce.yahoo.com/terms?locale=en-AU",
      "description": "Build PX = Building People Experience\nSetting You Up For Success\nDriven by a passion for business and people, BuildPX is on a mission to create workplaces people love to work and everyone can thrive \nYour Success is our Success",
      "industry": "Architecture and Planning",
      "headQuarters": "Melbourne, Victoria",
      "specialties": [
        "Human Resources",
        "People & Culture",
        "Talent Acquuisition",
        "Strategy",
        "Planning",
        "Employee Experience",
        "Training",
        "Learning & Development",
        "and Employer Branding"
      ],
      "lastUpdate": "2024-10-23T17:00:18.995477594+00:00",
      "url": "",
      "jobPosted": 0,
      "groupSize": "SIZE_A",
      "locations": ""
    },
    "locations": "Sydney NSW",
    "expiringDate": "2024-11-03T23:03:00.000Z",
    "hittedKeywords": []
  },
  {
    "postId": "79446953",
    "postTitle": "Salesforce Technical Architect",
    "postUrl": "https://www.seek.com.au/job/79446953",
    "payRange": "AUD 180000 - 220000 per annum",
    "debugText": "Are you a seasoned Salesforce Architect looking to elevate your career in a growing and dynamic environment? Join a mid-sized Salesforce partner as they expand across Australia, providing innovative Salesforce solutions to drive business success. With a hybrid working environment, this role offers flexibility and can be based in either Sydney or Brisbane.\n\n**The role:**\n\n As a Salesforce Architect, you will be at the forefront of shaping and delivering robust Salesforce architectures that meet client needs. You %%U+0027%% ll lead the design, implementation, and technical oversight of Salesforce projects, ensuring high-quality solutions that drive business growth and long-term client satisfaction.\n\n**Main\n Responsibilities:**\n\n - Design end-to-end Salesforce solutions that align with business objectives\n\n - Lead technical workshops and translate client requirements into scalable architectures\n\n - Oversee the development and deployment of custom Salesforce components\n\n - Conduct code and design reviews, ensuring adherence to best practices\n\n - Provide technical oversight during project implementation and ensure timely delivery\n\n - Develop integration strategies with other business systems\n\n - Act as a trusted advisor, offering strategic insights and guidance to clients\n\n - Mentor and lead technical teams, fostering a culture of continuous learning\n\n**You, as the ideal candidate will have:**\n\n - Extensive experience in Salesforce architecture and development\n\n - Proven ability to lead large-scale Salesforce implementations and integrations\n\n - Salesforce certifications such as Salesforce Certified Technical Architect (CTA), Certified Application Architect, or Certified System Architect\n\n - Strong leadership and stakeholder management skills\n\n - Experience with Agile and Scrum methodologies\n\n - Expertise in Apex, Visualforce, Lightning, and Salesforce integration techniques\n\n**What %%U+0027%% s in it for you?**\n\n - Flexible hybrid working environment – work from home or in the office\n\n - Exciting opportunities for career growth and professional development\n\n - Work with a passionate team in a collaborative and supportive environment\n\n - Make a meaningful impact by shaping the Salesforce solutions of tomorrow\n\nThis role can be based in either Sydney or Brisbane (hybrid working available) and will require someone to have full working rights in Australia.\n\n If you would like to know more about this role, please apply and we can arrange a time to speak!",
    "score": 7.309965528547764,
    "role": "Architects (Information & Communication Technology)",
    "workType": "Full time",
    "companyDetail": {
      "referenceId": "62540014",
      "name": "Sirius Technology NSW",
      "linkedin": "https://guce.yahoo.com/terms?locale=en-AU",
      "description": "Sirius People is a specialist recruitment agency based in Sydney and Melbourne. We recruit specialised professionals for contract and permanent roles across a number of industries, including Technology, Digital, Blue Collar, and White Collar\n\nWe have shortened the recruitment process by embedding our experienced consultants into their specialised communities. Each of our consultants owns a network of 700+ candidates, whom they speak with every month. We also connect with our candidates through our social media platforms, including Facebook, LinkedIn and X. This gives you access to both active and passive talent; and enables us to deliver high-quality, specialised candidates to you in a timely manner.\n\nWe partner with you to really get to know your culture and pain points. By painting a full picture of your business, our consultants can reach into our ever-growing specialist networks to quickly find exceptional talent who will help you achieve your company’s goals. This is one of the reasons why many of our current clients have partnered with us over the years.\n\nSo, whether you %%U+0027%% re looking for an exciting new opportunity or are looking to hire a specialist in the Technology, Business Support, Sales & Marketing, Blue Collar or Accounting & Finance industry, our specialised recruitment consultants are here to support your success.\n\nReach out to our consultants today!",
      "industry": "Human Resources Services",
      "groupSize": "SIZE_C",
      "headQuarters": "City of Sydney, New South Wales",
      "specialties": [
        "Recruitment",
        "IT Recruitment",
        "Business Support Recruitment",
        "Call Centre Recruitment",
        "Customer Service Recruitment",
        "Sales Recruitment",
        "Marketing Recruitment",
        "Events Recruitment",
        "Blue Collar Recruitment",
        "Accounting & Finance Recruitment",
        "Technology Recruitment",
        "",
        "Sydney Recruitment",
        "Melbourne Recruitment",
        "and Digital Recruitment"
      ],
      "lastUpdate": "2024-10-23T11:31:05.151260172+00:00",
      "url": "",
      "jobPosted": 0,
      "locations": ""
    },
    "locations": "Sydney NSW",
    "expiringDate": "2024-11-10T12:59:59.999Z",
    "hittedKeywords": []
  },
  {
    "postId": "79692624",
    "postTitle": "Solution Architect - Airline Tech. Modernisation Program",
    "postUrl": "https://www.seek.com.au/job/79692624",
    "payRange": "Up to $1200 p/d - Multi Year Program - WFH",
    "debugText": "**Job Title:** Solution Architect – AWS Cloud Flight Scheduling System (ACDM)\n\n**Location:** Sydney (Open to candidates based in Brisbane or Melbourne)\n\n**Job Type:** Full-Time Contract  %%U+007C%%  Multi-year program\n\n**About the Role:**\n\nWe are looking for an experienced **Solution Architect** to join a major technology modernization project focused on architecting a new AWS cloud-based **Flight Scheduling System**. This is a multi-year program for one of Australia’s leading airlines and will play a pivotal role in improving the overall efficiency and collaboration between airline operations and airports through **Airport Collaboration Decision Making (ACDM)**.\n\nIn this role, you will be responsible for designing and architecting a cloud-native system from the ground up, leveraging AWS services, ensuring scalability, reliability, and optimal performance. The project is highly complex and transformative, requiring the ability to work across multiple stakeholders and vendors to drive successful delivery.\n\n**Key Responsibilities:**\n\n- Lead the architecture and design of the AWS-based Flight Scheduling System for a major airline, ensuring alignment with business objectives and technical requirements.\n- Collaborate with airline operations and airport stakeholders to deliver a seamless **ACDM** solution that enhances decision-making and real-time coordination.\n- Drive the technology roadmap and work closely with geographically dispersed teams, both internal and external, to manage delivery timelines and technical execution.\n- Partner with key business stakeholders and vendors to ensure the architectural solutions meet strategic goals, are scalable, secure, and compliant with industry standards.\n- Guide and mentor development teams throughout the implementation phases, ensuring adherence to best practices in cloud architecture and engineering.\n- Act as the point of contact for architectural decisions and escalations, ensuring that technical risks are identified, mitigated, and communicated effectively.\n- Contribute to the overall technology transformation journey, focusing on modernisation and cloud enablement.\n\n**Essential Skills and Experience:**\n\n- Proven experience as a **Solution Architect** working on large-scale, complex technology transformation projects.\n- Strong expertise in **AWS Cloud architecture** and cloud-native design, with hands-on experience building and deploying solutions using AWS services.\n- Ability to architect from the ground up, understanding the full SDLC and how to design for scalability, reliability, and maintainability.\n- Excellent **stakeholder management** skills, with the ability to influence and collaborate across senior leadership and technical teams.\n- Strong **vendor management** experience, ensuring third-party vendors deliver to high standards and align with architectural goals.\n- Familiarity with **aviation/airline industry** systems, especially flight scheduling, airport operations, or ACDM, is highly desirable but not mandatory.\n- Proven experience working with geographically dispersed teams and managing technical and operational challenges in remote collaboration.\n\n**Desirable Skills:**\n\n- Experience with **aviation/airline industry systems** or **ACDM** solutions.\n- Understanding of **flight scheduling systems**, airport systems, or real-time operational platforms.\n- Knowledge of aviation regulatory requirements and standards.\n\n**Why Join Us?**\n\n- Be a part of a major tech modernisation program with the opportunity to shape a cutting-edge, cloud-native flight scheduling system.\n- Work with a highly skilled and diverse team, bringing together experts from various parts of the world.\n- This is a multi-year, transformative project that will have a lasting impact on the aviation industry.\n- Competitive day rate or salary and flexible working arrangements, with options to work from Sydney, Brisbane, or Melbourne.",
    "score": 5.733866656199098,
    "role": "Architects (Information & Communication Technology)",
    "workType": "Contract/Temp",
    "companyDetail": {
      "referenceId": "61887107",
      "name": "The Aquarium",
      "linkedin": "https://guce.yahoo.com/terms?locale=en-AU",
      "description": "The Aquarium is a Professional Services Group comprised of The Aquarium Talent Solutions, The Aquarium Professional Services, Consortio and Total Resource Solutions.\n\nWe are an established and highly successful talent provider to corporates, government and growing businesses. With over 2,000 individuals deployed across a wide range of clients, we have an unrivalled access to talent throughout Australia and through multiple off-shore channels. Our engagement services provide improved visibility over contractor logistics, promote efficiency and process improvement and reduce employment-associated risk.\n\nCombining over 50 years of experience in the Talent and Professional Services industry, The Aquarium are a highly-reputable group who provide exceptional service with a personable approach. Our services are agile—designed to be scalable and customisable— ensuring that we can easily adapt to changing circumstances and deliver first-class results.\n\nInnovation is a key component of our approach, as we continue to push the boundaries to find new and creative solutions to the challenges faced by our clients. We are not afraid to approach solutions from an alternate angle: we are constantly looking for new ways to help our clients achieve their goals faster and more efficiently.",
      "industry": "Professional Services",
      "groupSize": "SIZE_B",
      "headQuarters": "Haymarket, New South Wales",
      "specialties": [
        "Professional Services",
        "Recruitment",
        "Payroll",
        "Teams As a Service",
        "Contingent Workforce",
        "Engagement",
        "and Technology Services"
      ],
      "lastUpdate": "2024-10-23T13:23:19.616942804+00:00",
      "url": "",
      "jobPosted": 0,
      "locations": ""
    },
    "locations": "Sydney NSW",
    "expiringDate": "2024-11-22T01:31:00.000Z",
    "hittedKeywords": []
  }
]